import React from "react"

const Chuy = () => {
  return (
    <React.Fragment>
      <span className="tittle">Чуй</span>
      <span className="text">
        Город был основан в 1877 году русскими переселенцами в центральной части
        Таласской долины на левом берегу реки Талас, на месте древнего поселения
        времён Восточно-тюркского каганата, на высоте 1200 метров над уровнем
        моря. Ранее назывался Дмитриевка. В 1944 году был присвоен статус
        города. 29 октября 1958 года утратил статус города областного
        подчинения[3]. В город Талас 2 февраля 1987 года включено село Джаны-Чек
        из сельсовета Сорок лет Октября Таласского района[4].
      </span>
    </React.Fragment>
  )
}

export default Chuy
