import React from "react"

const JalalAbad = () => {
  return (
    <React.Fragment>
      <span className="tittle">Джалал-Абад</span>
      <span className="text">
        Возник как кишлак возле целебных источников, расположенных на горе
        Аюб-Тоо. Рядом с этими источниками стоит мазар над могилой(согласно
        местному преданию) одного из мусульманских святых Хазрет-Аюба
        Сабруллы(многострадальный), жившего на этой горе пять тысяч лет назад и
        исцелившегося от проказы за свою преданность Аллаху(Святой Иов - главный
        персонаж библейской книги Иова). Согласно этой легенде, излечившийся
        Хазрет Аюб ударами ног сначала создал два горячих источника, а после
        воткнул свой посох в червей, выпавших из его ран. Посох превратился в
        тутовое дерево, а черви, взобравшиеся на это дерево, превратились в
        коконы тутового шелкопряда. Жена Хазрет Аюба, Биби Рахим, стала прясть
        из коконов шелк. В честь нее назван один из источников, Кыз-Булак, в
        котором она по преданию обрела молодость[7]. Паломники шли к этим
        источникам для поклонения и для лечения ревматизма, золотухи, малярии, и
        других кожных и желудочных болезней. В Средней Азии и на Ближнем Востоке
        есть еще несколько мазаров Святого Иова: в Бухаре, Сирии, Омане, Турции,
        и Ливане[8]. Скотский рынок в царское время Скотский рынок Джалал-Абада
        на почтовой карточке ташкентского издательства И.А.Бек-Назарова
      </span>
    </React.Fragment>
  )
}

export default JalalAbad
