import React from "react"

const Naryn = () => {
  return (
    <React.Fragment>
      <span className="tittle">Нарын</span>
      <span className="text">
        Как и многие другие среднеазиатские города, Нарын возник как небольшое
        укрепление на торговых путях, которые вели из Восточного Туркестана
        (Кашгарии) в Среднюю Азию,для их защиты от разбойников. До середины XIX
        века как такового города в этой местности не было. C присоединением
        Средней Азии к Российской империи в 1868 году здесь был размещён русский
        гарнизон (укрепление Нарынское), позже появилась Нарынская слободка, и с
        этого момента началось строительство города[10]. Через Нарынское
        укрепление с Семиречьем постоянно действовало почтовое сообщение
        консульства России в Кашгарии. После Октябрьской революции 1917 года
        Нарын попал под контроль Красной армии, но в 1920 году здесь произошло
        столкновение между советскими войсками и белогвардейцами. После
        кровопролитных боёв город был отбит, и здесь установилась советская
        власть. В 1927 году Нарын стал административным центром созданной на тот
        момент Нарынской области[11].
      </span>
    </React.Fragment>
  )
}

export default Naryn
