import React from "react"

const Osh = () => {
  return (
    <React.Fragment>
      <span className="tittle">Ош</span>
      <span className="text">
        Ош являлся одним из религиозных мусульманских центров Средней Азии.
        Наиболее известен древними мечетями в центре города, а также горой
        Сулайман-Тоо (Тахт-и-Сулайман, Трон Соломона)[11], являющейся
        традиционным местом паломничества
      </span>
      <span className="text">
        Город расположен в предгорном оазисе. Поселение земледельцев эпохи
        бронзы было обнаружено на южном склоне горы Сулайман-Тоо. Ош является
        одним из старейших селений Киргизии. Ныне официально предложено считать,
        что история города насчитывает около 3000 лет[13][14]. Однако в
        исторической науке принято вести отсчёт возраста города от самого
        раннего упоминания в исторических актах, которое в летописях относится к
        IX веку н. э., что всё равно позволяет считать его старейшим городом
        страны.
      </span>

      <h4>Адрес: Город Ош, ул. Касымбекова, д. 20Г</h4>

      <div className="containerForYandexMap">
        <iframe
          title="osh"
          src="https://yandex.ru/map-widget/v1/?um=constructor%3Ad3b9f909a86fb063de4b54687973e7c5c64f9d1671d785c1501a93c6beba04a9&amp;source=constructor"
          width="500"
          height="400"
          frameborder="0"
        ></iframe>
      </div>

      <h3>Номер: 0555 73 22 11</h3>
    </React.Fragment>
  )
}

export default Osh
