import React from "react"

const YssykKol = () => {
  return (
    <React.Fragment>
      <span className="tittle">Ыссык-Куль</span>
      <span className="text">
        Иссык-Ку́льская о́бласть (кирг. Ысык-Көл облусу) — самый восточный регион
        Киргизии. Административный центр — город Каракол. Образована Указом
        Президиума Верховного Совета СССР от 21 ноября 1939 года с центром в
        городе Пржевальск (в область был преобразован Иссык-Кульский округ). 27
        января 1959 года упразднена[1]. Вновь создана 11 декабря 1970 года; в
        июле 1989—1991 году областной центр находился в городе Иссык-Куль, в
        1991 году вернулся в Пржевальск (в 1991 переименован в Каракол). Область
        берёт свое название от озера Иссык-Куль («тёплое озеро»[2]), второго по
        величине солёного озера в мире, которое никогда не замерзает, несмотря
        на свою высоту в горах Тянь-Шаня. Её окружают Алматинская область,
        Казахстан (север), Чуйская область (запад), Нарынская область
        (юго-запад) и Синьцзян, Китай (юго-восток).
      </span>
    </React.Fragment>
  )
}

export default YssykKol
