import React from "react"
import "./privacypolicy.css"
const Privacypolicy = () => {
  return (
    <div className="privacypolicy__container">
      <h1 className="privacypolicy-h1">
        Политика обработки персональных данных
      </h1>
      <p className="privacypolicy">
        Настоящая политика обработки персональных данных (далее — «Политика»)
        ОcОО Группы компаний «Новая Норма» разработана в соответствии с
        Конституцией Кыргызской республики, законом «Об информации персонального
        характера» № 129 от 20.07.2017 г., законом от 22 июля 2016 года № 130
        «Об информатизации», другими законами и принятыми в соответствии с ними
        подзаконными нормативно-правовыми актами с целью обеспечения защиты прав
        и свобод физического лица — субъекта персональных данных при обработке
        его персональных данных оператором фискальных данных ОсОО ГК «Новая
        Норма» (далее – «Оператор»).
        <br /> <br />
        1. Применение и сфера действия Политики <br />
        <br /> <br /> 1.1. Настоящая Политика применяется к Персональным Данным,
        которые Оператор обрабатывает в связи c: <br />
        <br /> <br /> 1.1.1. оказанием услуг по обработке фискальных данных и
        сопутствующих услуг (в частности, услуг по направлению кассового чека в
        электронной форме на абонентские номера и адреса электронной почты
        потребителей, информационных и информационно-аналитических и других),
        далее – «Услуги»;
        <br /> <br /> 1.1.2. использованием сайта ОсОО «Новая Норма»
        www.norma.kg, в том числе его поддоменов: http://lk.norma.kg,
        http://pk.norma.kg, http://market.norma.kg и других (далее- «Сайт»), а
        также любых сервисов, служб, продуктов, web-форм, размещенных на Сайте
        (далее – «Сервисы»). Термин «Сайт» распространяется также на мобильные
        приложения, правообладателем которых является Оператор, доступные для
        загрузки на Сайте или внешних ресурсах, а также интерфейсы прикладного
        программирования (API), используемые для реализации правоотношений между
        Оператором и Субъектом ПД. При этом под Использованием понимаются любые
        действия Субъекта ПД по получению доступа к Сайту/Сервисам или отдельным
        его частям, функциям, интерфейсам как с помощью аутентификационных
        данных (логина и пароля), так и без них; воспроизведение,
        распространение, доведение до всеобщего сведения, сообщение по кабелю и
        в эфир, импорт, прокат, публичное исполнение, перевод и другая
        переработка материалов, информации (в полном объеме или частично),
        размещенных на Сайте и/или в Сервисах; любые другие способы
        использования, независимо от того, совершаются ли соответствующие
        действия в целях извлечения прибыли или без такой цели.
        <br /> <br /> 1.1.3. получением Оператором Персональных данных через
        клиентские службы, в ходе маркетинговых компаний, конкурсов, розыгрышей,
        исследований (опросов), либо получаемые через web-формы Сайта и/или
        Сервисов, API, а также через приложения, API и страницы Оператора на
        интернет-платформах, сайтах, принадлежащих третьим лицам, в том числе
        Партнерам. Под Партнерами Оператора понимаются организации и
        индивидуальные предприниматели, действующие от своего имени или от имени
        Оператора и продвигающие Услуги/Сервисы Оператора на основании
        заключенных с ним посреднических договоров, договоров оказания услуг по
        привлечению клиентов и других договоров/соглашений.
        <br /> <br /> 1.1.4. Получением Оператором Персональных данных от
        Партнеров.
        <br /> <br /> 1.2. Использование Сайта и/или Сервисов (п. 1.1.2
        Политики) означает ознакомление и полное безоговорочное согласие
        Субъекта ПД с настоящей Политикой и указанными в ней условиями обработки
        его Персональных данных. В случае несогласия (полного либо частичного) с
        этими условиями Субъект ПД должен воздержаться от Использования Сайта
        и/или Сервисов.
        <br /> <br /> 1.3. Сайт может содержать гиперссылки на другие веб-сайты,
        предоставленные третьими лицами. Оператор не контролирует такие
        сторонние веб-сайты или информацию, размещенную на таких веб-сайтах.
        Оператор не несет ответственности за защиту и конфиденциальность любой
        информации, предоставленной Субъектом ПД на веб-сайтах третьих лиц,
        после того как он покинул Сайт.
        <br /> <br /> 2. Субъекты ПД и Состав Персональных Данных
        <br /> <br /> 2.1. В рамках настоящей Политики к Субъектам ПД относятся
        физические лица, действующие от собственного имени, а также физические
        лица-представители юридических лиц, уполномоченные действовать от имени
        таких юридических лиц на основании устава, доверенности, трудового
        договора, гражданско-правового договора или по другим основаниям. В том
        числе к уполномоченным представителям юридических лиц относятся лица,
        осуществившие доступ к учетным записям на Сайте и/или в Сервисах, с
        использованием логина и пароля, присвоенного соответствующему
        юридическому лицу в рамках заключенного им с Оператором
        договора/соглашения об оказании Услуг/предоставлении Сервиса.
        <br /> <br /> 2.2. В рамках настоящей Политики Персональным Данным
        относятся:
        <br /> <br /> 2.2.1. Информация о Субъекте ПД, которая предоставляется
        им в целях осуществления регистрации (создании учётной записи) на Сайте
        и в Сервисах, а также в процессе использования Сайта, Сервисов и
        оказания Услуг на основании соответствующего договора или соглашения,
        заключенных с самим Субъектом ПД или с юридическим лицом, от имени
        которого Субъект ПД заключил и исполняет указанные соглашения и
        договоры. Такая информация носит личный характер и позволяет
        идентифицировать личность Субъекта ПД, включая, но не ограничиваясь:
        Фамилия, Имя, Отчество или псевдоним; Дата рождения и возраст;
        Контактный телефон; Адрес электронной почты; Почтовый адрес; Адрес
        местонахождения, проживания и/или регистрации.
        <br /> <br /> 2.2.2. Данные, которые передаются в процессе использования
        Сайта с помощью установленного на устройстве Субъекта ПД программного
        обеспечения, в том числе IP-адрес, данные файлов cookie, информация о
        браузере (или иной программе, с помощью
        <br /> <br /> которой осуществляется доступ к Сайту), технические
        характеристики оборудования и программного обеспечения, используемых
        Субъектом ПД, дата и время доступа к Сайту, дата и время акцепта
        размещенных на Сайте оферт, адреса запрашиваемых страниц и иная подобная
        информация.
        <br /> <br /> 2.2.3. Иная информация о Субъекте ПД, обработка которой
        предусмотрена условиями использования отдельных Сервисов, условиями
        оказания тех или иных Услуг, установленными соответствующими договорами
        и соглашениями.
        <br /> <br /> 2.3. Оператор не проверяет достоверность Персональных
        Данных, предоставляемых Субъектом ПД, и не имеет возможности оценивать
        его дееспособность. Однако Оператор исходит из того, что Субъект ПД
        предоставляет достоверные и достаточные Персональные Данные и
        поддерживает их в актуальном состоянии.
        <br /> <br /> 3. Цели обработки Персональных Данных
        <br /> <br /> 3.1. Оператор обрабатывает Персональные Данные в следующих
        целях:
        <br /> <br /> 3.1.1. идентификация стороны в рамках Сервисов, соглашений
        и договоров, заключенных Оператором;
        <br /> <br /> 3.1.2. оказание Услуг, предоставление Сервисов в ходе
        исполнения Оператором соглашений и договоров, заключенных с самим
        Субъектом ПД или с юридическим лицом, от имени которого Субъект ПД
        заключил и исполняет указанные соглашения и договоры;
        <br /> <br /> 3.1.3. связь с Субъектом ПД, в том числе направление
        уведомлений, сообщений, запросов и информации, касающихся оказания Услуг
        и/или использования Сервисов, исполнения соглашений и договоров, а также
        обработка запросов и заявок от Субъекта ПД;
        <br /> <br /> 3.1.4. улучшение качества оказываемых Услуг,
        предоставляемых Сервисов, удобства их использования, разработка новых
        Сервисов;
        <br /> <br /> 3.1.5. направление Субъекту ПД информационных и/или
        рекламных сообщений (в том числе таргетированных рекламных материалов)
        об Услугах, Сервисах, о событиях в деятельности Оператора, о
        мероприятиях, организуемых Оператором и/или Партнерами для клиентов
        и/или потенциальных клиентов (в том числе семинарах, конференциях,
        вебинарах, розыгрышах, акциях), а также товарах, работах Оператора (если
        применимо), товарах, работах, услугах Партнеров и третьих лиц;
        <br /> <br /> 3.1.6. проведение статистических и иных исследований на
        основе обезличенных данных.
        <br /> <br /> 3.1.7. предупреждение или пресечение незаконных и/или
        несанкционированных действий третьих лиц, обеспечение соблюдения
        требований действующего законодательства Кыргызской республики.
        <br /> <br /> 4. Условия обработки Персональных Данных и их передачи
        третьим лицам
        <br /> <br /> 4.1. Оператор хранит Персональные Данные в течение срока,
        необходимого для достижения соответствующей цели обработки Персональных
        Данных, если иной срок хранения не установлен договорами, соглашениями
        между Оператором и Субъектом ПД (либо юридическим лицом, представителем
        которого является Субъект ПД) либо действующим законодательством КР.
        <br /> <br /> 4.2. Оператор обязуется принимать все необходимые и
        достаточные организационные и технические меры для защиты Персональных
        Данных от неправомерного или случайного доступа, уничтожения, изменения,
        блокирования, копирования, распространения, а также от иных
        неправомерных действий с ней третьих лиц, в том числе обязуется не
        осуществлять без согласия Субъекта ПД продажу его Персональных Данных,
        их опубликование в открытом доступе и соблюдать требования к обработке
        персональных данных, предусмотренные законом Кыргызской республики от 20
        июля 2017 года № 129 «Об информации персонального характера». Положения
        настоящего пункта не распространяются на случаи добровольного
        предоставления Субъектом ПД информации о себе для общего доступа
        неограниченному кругу лиц.
        <br /> <br /> 4.3. Субъект ПД вправе:
        <br /> <br /> 4.3.1. требовать подтверждения факта обработки
        Персональных данных, и в случае подтверждения факта обработки доступа к
        своим Персональным данным требовать устранения неточностей в
        Персональных Данных, уничтожения, прекращения обработки Персональных
        Данных;
        <br /> <br /> 4.3.2. обращаться к Оператору для реализации вышеуказанных
        прав по адресу электронной почты, указанному на Сайте, и через форму
        обратной связи на Сайте.
        <br /> <br /> 4.4. Оператор вправе раскрывать (передать) Персональные
        данные третьим лицам в следующих случаях:
        <br /> <br /> 4.4.1. Субъект ПД выразил согласие на такие действия;
        <br /> <br /> 4.4.2. Раскрытие необходимо для использования
        определенного Сервиса либо для исполнения определенного соглашения или
        договора с Субъектом ПД или юридическим лицом, представителем которого
        выступает Субъект ПД;
        <br /> <br /> 4.4.3. раскрытие осуществляется на основании законных
        требований органов государственной власти, правоохранительных органов и
        других уполномоченных органов и организаций, либо раскрытие Персональных
        Данных предусмотрено действующим законодательством Кыргызской республики
        в рамках установленной процедуры;
        <br /> <br /> 4.4.4. раскрытие Персональных Данных происходит в рамках
        реорганизации, продажи или иной передачи бизнеса Оператора (полностью
        или в части), при этом к приобретателю переходят все обязательства по
        соблюдению условий настоящей Политики применительно к получаемым им
        Персональным Данным;
        <br /> <br /> 4.4.5. В целях обеспечения возможности защиты прав и
        законных интересов Оператора или третьих лиц в случаях, когда Субъект ПД
        или юридическое лицо, представителем которого является Субъект ПД,
        нарушает договоры и соглашения, заключенные с Оператором, настоящую
        Политику, либо документы, содержащие условия использования конкретных
        Сервисов, либо существует угроза такого нарушения.
        <br /> <br /> 4.5. Трансграничная передача Персональных Данных
        Оператором не осуществляется.
        <br /> <br /> 4.6. Обработка Данных Пользователя производится любым
        законным способом, в том числе в информационных системах Оператора
        Сервиса, путем совершения, в том числе, следующих действий: сбора,
        систематизации, накопления, хранения, уточнения (обновление, изменение),
        анализа, использования, передачи, обезличивания, блокирования,
        уничтожения. Указанные действия совершаются без использования средств
        автоматизации. При обработке персональных данных Оператор
        руководствуется законом Кыргызской республики «Об информации
        персонального характера».
        <br /> <br /> 4.7. Субъект ПД может в любой момент изменить (обновить,
        дополнить) предоставленные им Персональные Данные с учетом функционала
        тех или иных Сервисов, а также связавшись с Оператором способами,
        предусмотренными соответствующим договором или соглашением с Оператором,
        а также через форму обратной связи на Сайте.
        <br /> <br /> 4.8. Субъект ПД может удалить Персональные Данные,
        предоставленные им в рамках определенной учетной записи на Сайте или в
        Сервисе. При этом удаление учетной записи может повлечь невозможность
        использования соответствующих Сервисов.
        <br /> <br /> 4.9. Оператор вправе заблокировать изменение и/или
        удаление Персональных Данных, если в соответствии с требованиями
        действующего законодательства Кыргызской республики Оператор обязан
        сохранить измененную или удаленную информацию на срок, установленный
        законодательством, и передать такую информацию в соответствии с
        законодательно установленной процедурой государственному органу.
        <br /> <br /> 4.10. Оператор вправе использовать файлы cookie в
        рекламных, статистических, исследовательских и других целях, не
        запрещенных действующим законодательством Кыргызской республики.
        <br /> <br /> 4.11. Субъект ПД осознает, что оборудование и программное
        обеспечение, используемые им для посещения сайтов в сети Интернет могут
        обладать функцией запрещения операций с файлами cookie (для любых сайтов
        или для определенных сайтов), а также удаления ранее полученных файлов
        cookie.
        <br /> <br /> 4.12. Оператор вправе установить, что предоставление
        определенного Сервиса возможно лишь при условии, что прием и получение
        файлов cookie разрешены Субъектом ПД.
        <br /> <br /> 4.13. Структура файла cookie, его содержание и технические
        параметры определяются Оператором и могут изменяться без
        предварительного уведомления Субъекта ПД.
        <br /> <br /> 5. Согласие Субъекта ПД
        <br /> <br /> 5.1. Принимая условия настоящей Политики (п. 1.2.
        Политики), Субъект ПД:
        <br /> <br /> 5.1.1. дает Оператору свое согласие на обработку и
        передачу Персональных Данных в целях и способами, предусмотренными
        настоящей Политикой, а также соглашается, что вся информация
        предоставляется им добровольно, по его усмотрению и в его интересах. В
        частности, согласие субъекта ПД распространяется на получение от
        Оператора информационных и/или рекламных сообщений (в том числе
        таргетированных рекламных материалов) об Услугах, Сервисах, о событиях в
        деятельности Оператора, о мероприятиях, организуемых Оператором и/или
        Партнерами для клиентов и/или потенциальных клиентов (в том числе
        семинарах, конференциях, вебинарах, розыгрышах, акциях), а также
        товарах, работах Оператора (если применимо), товарах, работах, услугах
        Партнеров и третьих лиц;
        <br /> <br /> 5.1.2 соглашается на передачу его Персональных Данных
        Партнерам в целях продвижения товаров, работ, услуг Партнеров, в
        соответствии с условиями договоров и соглашений, заключенных Оператором
        с Субъектом ПД или юридическим лицом, представителем которого является
        Субъект ПД.
        <br /> <br /> 6. Изменение Политики конфиденциальности. Применимое
        законодательство
        <br /> <br /> 6.1. Оператор имеет право вносить изменения в настоящую
        Политику. Новая редакция Политики вступает в силу с момента ее
        размещения на Сайте, если иное не предусмотрено новой редакцией
        Политики. Действующая редакция постоянно доступна на странице по адресу:
        https://norma.kg/pdf/privacy-policy-100370.pdf
        <br /> <br /> 6.2. К настоящей Политике и отношениям между Субъектом ПД
        и Оператором, возникающим в связи с применением Политики, подлежит
        применению право Кыргызской республики.
        <br /> <br />
        <br /> Дата публикации: 17.05.2021
        <br />
      </p>
    </div>
  )
}

export default Privacypolicy
